ads/heapsort.html
---
layout: page
title: Heapsort
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Heapsort</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Idee:</b> Baue sortiert Folge von hinten nach vorn auf (d.h. suche zuerst
das größte Element und verschiebe es ans Ende des Felds). Vertauche
wiederholt die Wurzel des Heaps (d.h. das maximale Element im
unsortierten Berecih) mit dem letzen Element des Heaps (das an der
Grenze zum sortierten Bereich steht). Verkleinere den unsortierten
Bereich (Bereich des Heaps) um 1. Danach rufe <code>HEAPIFY</code> wieder auf, um
die Heap-Eigenschaft im unsortierten Bereich wiederherzustellen.
</p>

<pre class="example">
HEAPSORT(A)
  integer size = length(A);
  BUILDHEAP(A);

  for in = size - 1 downto 1 do
    vertauche A[0] und A[i]; // vertausche Wurzel mit erstem Element des sortierten Bereichs (d.h. das max. landet hinten)
    size = size - 1;         // verkleinere unsortierten Bereich
    HEAPIFY(A, 0, size);
  od
</pre>

<p>
<b>Laufzeit</b>: \(\mathcal{O}(n \log n)\)
</p>
</div>
</div>
